paulusTecnion/uberlogger-stm32/Core/Src/main.c
  memset(data_buffer, 0, sizeof(data_buffer));

  spi_msg_slow_freq_1->startByte[0] = 0xFA;
  spi_msg_slow_freq_1->startByte[1] = 0xFB;

  spi_msg_slow_freq_2->stopByte[0] = 0xFB;
  spi_msg_slow_freq_2->stopByte[1] = 0xFA;


  HAL_ADCEx_Calibration_Start(&hadc1);
  Adc_start();
  busy = 1;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	  spi_ctrl_loop();
//	  Config_Handler();
	  datardypin = HAL_GPIO_ReadPin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin);

	  busy = 0; // reset interrupt timeout

	  // forward trigger input to esp32
	  if (HAL_GPIO_ReadPin(GPIOB, ext_trigger_input))
	  {
	      // Input is high and hasn't been debounced yet
	      if (ext_trigger_input_value_debounced == 0)
	      {
	          // Start debouncing: set the previous time to the current time
	          _debounce_prev_time = HAL_GetTick();
	          ext_trigger_input_value_debounced = 1;  // Mark as debouncing
	      }

	      // Check if debounce time has passed
	      if ((HAL_GetTick() - _debounce_prev_time > _debounce_time_ext_input))
	      {
	    	  ext_trigger_input_value = 1;  // Set the output high
	      }
	  }
	  else
	  {
	      // Input is low, reset debouncing and immediately set output low
	      ext_trigger_input_value = 0;
	      ext_trigger_input_value_debounced = 0;  // Reset debouncing state
	      _debounce_prev_time = HAL_GetTick();    // Reset debounce timer
	  }

	  HAL_GPIO_WritePin(EXT_PIN_VALUE_GPIO_Port, EXT_PIN_VALUE_Pin, ext_trigger_input_value);

	  switch(MainState)
	  {
	  	  case MAIN_WAIT_FOR_TRIGGER:


	  		if (ext_trigger_input_value && logging_en)
	  		{
	  			// Debounce the input

	  				// start the ADC timer
	  			  tim3_counter = 0;
				  adc_is_half = 0;
				  adc_16b_is_half = 0;
				  adc_ready = 0;
				  gpio_result_write_ptr = 0;
				  time_result_write_ptr = 0;
				  gpio_is_half = 0;
				  gpio_ready = 0;
				  TIM3->CNT = 0;
				  NextState = MAIN_LOGGING;
				  HAL_TIM_Base_Start_IT(&htim3);

	  		} else if (!logging_en){
	  			NextState = MAIN_IDLE;
	  		}

		  break;

	  	  case MAIN_LOGGING:

	  		// Forward the state of the external input to the ESP32 via EXT_PIN_VALUE_Pin
	  		// This way the ESP32 knows logging has stopped and data needs to be retrieved.

	  		if (adc_ready && gpio_ready)
			{
	//			gpio_result_write_ptr = 0;
	//			time_result_write_ptr = 0;
				// Half way we have the pointers start at the beginning
//				if (READ_BIT(spi_ctrl_state,SPI_CTRL_SENDING))
//				{
//					overrun = 1;
//				}

				tim3_counter=0;

				if (adc_resolution == ADC_16_BITS)
				{

					if (adc_16b_is_half)
					{
	//					uint16_t * adcData = (uint16_t*)spi_msg_1_ptr->adcData;
						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_1_t));
					} else {
						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_2_t));
					}

				} else {

					if (adc_is_half)
					{
	//					uint16_t * adcData = (uint16_t*)spi_msg_1_ptr->adcData;
						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_1_t));
//						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_slow_freq_t));
					} else {
						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_2_t));
//						spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_slow_freq_t));
					}
				}

				adc_ready = 0;
				gpio_ready = 0;

			}


	  	  if ((!logging_en || overrun) || (ext_trigger_input_value == 0 && _trigger_mode == TRIGGER_MODE_EXTERNAL))
		  {
//				  if (overrun)
//				  {
//					  HAL_GPIO_WritePin(DATA_OVERRUN_GPIO_Port , DATA_OVERRUN_Pin, SET);
//				  }
//				  overrun =0;
			  // reset the this variable to 0, since we expect that a "

			  HAL_TIM_Base_Stop_IT(&htim3);

			  // Delay of 50 ms, since signal ringing may cause a retrigger of LOGGING state
			  HAL_Delay(50);
			  // Set ADC to single conversion measure mode

			  if (ext_trigger_input_value == 0 && _trigger_mode == TRIGGER_MODE_EXTERNAL && logging_en)
			  {
				  NextState = MAIN_WAIT_FOR_TRIGGER;
			  } else {
				  NextState = MAIN_IDLE;
			  }
		  }
		  break;


		  case MAIN_IDLE:
			  // In case logging gets enabled and we are in continuous mode, start the ADC
			  if (logging_en && spi_ctrl_isIdle() && (_trigger_mode != TRIGGER_MODE_EXTERNAL))
			  {

				  tim3_counter = 0;
				  adc_is_half = 0;
				  adc_16b_is_half = 0;
				  adc_ready = 0;
				  gpio_result_write_ptr = 0;
				  time_result_write_ptr = 0;
				  gpio_is_half = 0;
				  gpio_ready = 0;
				  // Start TIM3 and DMA conversion
				  TIM3->CNT = 0;

				  NextState = MAIN_LOGGING;

				  HAL_TIM_Base_Start_IT(&htim3);


			  } else if (logging_en && spi_ctrl_isIdle() && _trigger_mode == TRIGGER_MODE_EXTERNAL) {
				 // In this case we wait for the external trigger to become high
				  _debounce_prev_time = HAL_GetTick();
				  NextState = MAIN_WAIT_FOR_TRIGGER;

			  } else  {
				  // Check for events

				  if (spi_ctrl_msg_received())
				  {
					spi_cmd_t * cmd = (spi_cmd_t*)&cmd_buffer;
					spi_cmd_t resp;
					  switch(cmd->command)
					  {

						  case STM32_CMD_SETTINGS_MODE:
							  resp.command = STM32_CMD_SETTINGS_MODE;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SETTINGS_MODE, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t)) == HAL_OK)
							  {

								HAL_ADC_Stop_DMA(&hadc1);

								NextState = MAIN_CONFIG;
							  }

						  break;

						  case STM32_CMD_SINGLE_SHOT_MEASUREMENT:

							  resp.command = STM32_CMD_SINGLE_SHOT_MEASUREMENT;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SINGLE_SHOT_MEASUREMENT, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t)) == HAL_OK)
							  {
								  NextState = MAIN_SINGLE_SHOT;
							  }
							  break;

						  case STM32_CMD_SEND_LAST_ADC_BYTES:
							  if (adc_resolution == ADC_16_BITS)
							  {
								  if (!adc_16b_is_half || _singleshot)
								  {
									  // adc_is_half == 1 means the last message sent was spi_msg_1
									  // So we are now still writing in spi_msg_2.
									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_1_t));
									  _singleshot = 0;
								  } else {
									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_2_t));
								  }
							  } else {
								  if (!adc_is_half || _singleshot)
								  {
									  // adc_is_half == 1 means the last message sent was spi_msg_1
									  // So we are now still writing in spi_msg_2.
									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_1_t));
//									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_slow_freq_t));
								  } else {
									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_2, sizeof(spi_msg_2_t));
//									  spi_ctrl_send((uint8_t*)spi_msg_slow_freq_1, sizeof(spi_msg_slow_freq_t));
								  }
							  }


							  break;

						  case STM32_CMD_NOP:
					//			  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_NOP);
//							  resp.command = CMD_NOP;
//							  resp.data = CMD_RESP_OK;
//							  spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t));
							  break;

						  default:
					//			  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_UNKNOWN);
							  resp.command = STM32_CMD_NOP;
							  resp.data = CMD_RESP_NOK;
							  spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t));

